FoamProject/blockMeshVortexShedding/templateCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       47760;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       47810;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       47860;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       48360;
    }
    leadingEdge
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       48860;
    }
    trailingEdge
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       48870;
    }
    upperSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       48880;
    }
    lowerSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       48960;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          48400;
        startFace       49040;
    }
)

// ************************************************************************* //
